{
	"version": "https://jsonfeed.org/version/1",
	"title": "Dr. Nolen Scaife",
	"icon": "https://micro.blog/drno/avatar.jpg",
	"home_page_url": "https://nolen.io/",
	"feed_url": "https://nolen.io/feed.json",
	"items": [
		
			{
				"id": "http://nolen.micro.blog/2023/02/25/repairing-a-daisywriter.html",
				"title": "Repairing a DaisyWriter",
				"content_html": "<p>Back in February 2021, I bought a lot of older computer equipment on Craigslist. The year before, my pandemic project was building a DOS/Win98-era (but that’s a story for another time), and I had a few saved searches for parts. At the time, I was most interested in picking up a couple of CRT monitors.</p>\n<p>At the pickup location, it seemed like we wouldn’t be able to fit everything in the car. We made it, <em>barely</em>, but I recall driving slowly and the rearview mirror being blocked. It took almost two weeks to work through everything to see what worked, what didn’t, what should be kept, and what was junk. The gear ranged from the early 80s through the early 00s and was a standard mix: CRT monitors, printers, accessories, and cables. One thing stuck out, though.</p>\n<p><img src=\"https://nolen.io/uploads/2023/d3fda0cf13.jpg\" alt=\"The DaisyWriter \"></p>\n<h2 id=\"the-printer\">The Printer</h2>\n<p>I hadn’t seen a printer quite like the DaisyWriter. The mechanism, a <a href=\"https://en.wikipedia.org/wiki/Daisy_wheel_printing\"><em>daisy wheel</em></a>, turns out to be common; companies like Commodore, Tandy, and Brother made these for many years. Wheels contain a set of characters in a circle, and the printer will rotate the wheel to the desired character. These can be swapped as desired to change the type (for example, to print in script or italics). The mechanism is similar to a typewriter, since the character is pressed through a ribbon onto the paper. In many ways, the DaisyWriter is an automatic typewriter.</p>\n<p>Sadly, when the printer was turned on, it would immediately make an alarm sound and the error light would turn on. Trying to send anything to the printer failed. I posted on Twitter about the DaisyWriter in February. I couldn’t find anything about this printer online, save a few mentions of it in lists of daisy wheel printers and a <a href=\"https://www.chicagotribune.com/news/ct-xpm-1985-02-03-8501070465-story.html\">Chicago Tribune review from 1985</a>. eBay had a single listing for a manual for the DaisyWriter. Once I ordered it, I put the printer away to tackle it later.</p>\n<blockquote>\n<p>A near perfect printer. It retails for $1,195. — Peter McWilliams</p>\n</blockquote>\n<p>Before I continue, I want to take a moment to note how <strong>incredibly lucky</strong> I was to find a DaisyWriter manual. This printer is a footnote in computing history at best. It configures with a bank of 24 unlabeled dip switches, and sounds a buzzer and lights a descriptive <em>ERROR</em> light when there’s a problem. Other than trial and error, there’s no way to know what the issue is.</p>\n<p><img src=\"https://nolen.io/uploads/2023/fe7c5e8d87.jpg\" alt=\"Front panel of the DaisyWriter\"><img src=\"https://nolen.io/uploads/2023/562e8f31d8.jpg\" alt=\"A view of failure from the computer\"></p>\n<h2 id=\"repairing-and-some-help\">Repairing and Some Help</h2>\n<p>In September 2021, I received an email from Jonathan, who saw my tweets and shared his experience repairing his own DaisyWriter. He also has some manuals for this printer and <a href=\"https://archive.org/details/daisywriter-printer-manuals/Daisywriter_Information_Manual/\">uploaded them to the Internet Archive</a>. I didn’t pick up the project again until November 2022, and I was fortunate that Jonathan replied and was still interested in this printer. Over the next couple of months, he and I exchanged several emails and I learned a lot about his repairs.</p>\n<p>With manual in hand, I quickly resolved the first issue (and the one that was sounding the alarm in 2021): it was out of paper. Certain configurations of dip switches tell the printer if it has an automatic paper feeder, for example, and one behavior I noticed is that some of these settings cause the printer to check whether paper is present at power-on. It’s simple, but without the manual, I would not have known which dip switches to flip.</p>\n<p>Thankfully, the manual also describes a testing procedure. A series of button presses on the front panel begins printing information about the printer and a test of all the characters on the daisy wheel. The printer would type all the characters and move the paper correctly, but it would only indent the paper and did not transfer ink. A simple fix, I thought.</p>\n<p>I ordered a new ribbon, expecting the old one to be dry (and perhaps it was), and a week later installed it into the printer. The printer typed one or two characters with ink, then chewed a hole in the ribbon and tore it in half. I can’t remember how I knew this, but I recalled that you can tape ribbons back together. A few minutes later, the ribbon was back in service, but the printer was not.</p>\n<p><img src=\"https://nolen.io/uploads/2023/32d7e7c278.jpg\" alt=\"This mechanism had old rubber that caused it to stick\"></p>\n<p>Jonathan mentioned that he had to repair his printer’s carriage mechanism. There is a small piece of rubber on the underside that turns to goo. There’s an electromagnet that moves a weight that clicks back to the start position when the magnet disengages; when that weight hits the old rubber, it sticks. When that happens, the ribbon doesn’t advance (and the symptom for mine was the torn ribbon). The area isn’t particularly easy to reach, either! I tried to cheat and scrape out the old rubber from the side of the mechanism, but that didn’t correct it. Disassembly was challenging, but not impossible (though I did rip and repair a flex cable in the process). There are quite a few small gears and at least one C-clip that needs to be removed. Once everything was apart, it was simple to remove the old rubber and clean up the sticky residue that remained. That cleared up the ribbon issue, and I finally got a test page!</p>\n<p><img src=\"https://nolen.io/uploads/2023/e3402ba83a.mov\" alt=\"Success!\"></p>\n<h2 id=\"a-detour-for-the-paper-feeder\">A Detour for the Paper Feeder</h2>\n<p>My printer came with a cut sheet feeder, which is only mentioned in the manual I have long enough to refer the reader to a <em>different</em> manual, which I don’t have. It seems to be a simple enough mechanism. As the platen turns, there’s a gear that turns; the feeder attaches to this gear. This turns a mechanism on the feeder which, every so often, turns a set of rubbered wheels to push the next piece of paper down. The only trouble was that it didn’t work!</p>\n<p>Friction is created by a spring-loaded paper tray that pushes the paper towards the wheels. In my case, however, the wheels just spin on the paper. Jonathan pointed me in the direction of <a href=\"https://www.jjshort.com\">J.J. Short</a>, who was able to create and apply new rubber for the wheels. The new rubber grips the paper well, but it still doesn’t reliably feed the paper.</p>\n<p>Sadly, this part of the story doesn’t (yet) a happy ending. I’m not certain why the paper doesn’t feed reliably. My current guess is that the feeder’s mechanism is positioned incorrectly, so the printer is expecting the paper to be in a certain position when it isn’t. I’ve decided to put this aside for a while, and I’ll pick it up again later.</p>\n<p><img src=\"https://nolen.io/uploads/2023/99dbda5f10.jpg\" alt=\"The paper feeder mechanism\"></p>\n<h2 id=\"epilogue\">Epilogue</h2>\n<p>This printer has been quite a project, and it still isn’t done. I’m excited to try a few new things with it, and I’ll post more on these separately!</p>\n",
				"content_text": "Back in February 2021, I bought a lot of older computer equipment on Craigslist. The year before, my pandemic project was building a DOS/Win98-era (but that’s a story for another time), and I had a few saved searches for parts. At the time, I was most interested in picking up a couple of CRT monitors. \n\nAt the pickup location, it seemed like we wouldn’t be able to fit everything in the car. We made it, _barely_, but I recall driving slowly and the rearview mirror being blocked. It took almost two weeks to work through everything to see what worked, what didn’t, what should be kept, and what was junk. The gear ranged from the early 80s through the early 00s and was a standard mix: CRT monitors, printers, accessories, and cables. One thing stuck out, though.\n\n![The DaisyWriter ](https://nolen.io/uploads/2023/d3fda0cf13.jpg)\n\n## The Printer\nI hadn’t seen a printer quite like the DaisyWriter. The mechanism, a [_daisy wheel_](https://en.wikipedia.org/wiki/Daisy_wheel_printing), turns out to be common; companies like Commodore, Tandy, and Brother made these for many years. Wheels contain a set of characters in a circle, and the printer will rotate the wheel to the desired character. These can be swapped as desired to change the type (for example, to print in script or italics). The mechanism is similar to a typewriter, since the character is pressed through a ribbon onto the paper. In many ways, the DaisyWriter is an automatic typewriter.\n\nSadly, when the printer was turned on, it would immediately make an alarm sound and the error light would turn on. Trying to send anything to the printer failed. I posted on Twitter about the DaisyWriter in February. I couldn’t find anything about this printer online, save a few mentions of it in lists of daisy wheel printers and a [Chicago Tribune review from 1985](https://www.chicagotribune.com/news/ct-xpm-1985-02-03-8501070465-story.html). eBay had a single listing for a manual for the DaisyWriter. Once I ordered it, I put the printer away to tackle it later.\n\n> A near perfect printer. It retails for $1,195. — Peter McWilliams\n\nBefore I continue, I want to take a moment to note how **incredibly lucky** I was to find a DaisyWriter manual. This printer is a footnote in computing history at best. It configures with a bank of 24 unlabeled dip switches, and sounds a buzzer and lights a descriptive _ERROR_ light when there’s a problem. Other than trial and error, there’s no way to know what the issue is.\n\n![Front panel of the DaisyWriter](https://nolen.io/uploads/2023/fe7c5e8d87.jpg)![A view of failure from the computer](https://nolen.io/uploads/2023/562e8f31d8.jpg)\n\n## Repairing and Some Help\nIn September 2021, I received an email from Jonathan, who saw my tweets and shared his experience repairing his own DaisyWriter. He also has some manuals for this printer and [uploaded them to the Internet Archive](https://archive.org/details/daisywriter-printer-manuals/Daisywriter_Information_Manual/). I didn’t pick up the project again until November 2022, and I was fortunate that Jonathan replied and was still interested in this printer. Over the next couple of months, he and I exchanged several emails and I learned a lot about his repairs.\n\nWith manual in hand, I quickly resolved the first issue (and the one that was sounding the alarm in 2021): it was out of paper. Certain configurations of dip switches tell the printer if it has an automatic paper feeder, for example, and one behavior I noticed is that some of these settings cause the printer to check whether paper is present at power-on. It’s simple, but without the manual, I would not have known which dip switches to flip.\n\nThankfully, the manual also describes a testing procedure. A series of button presses on the front panel begins printing information about the printer and a test of all the characters on the daisy wheel. The printer would type all the characters and move the paper correctly, but it would only indent the paper and did not transfer ink. A simple fix, I thought.\n\nI ordered a new ribbon, expecting the old one to be dry (and perhaps it was), and a week later installed it into the printer. The printer typed one or two characters with ink, then chewed a hole in the ribbon and tore it in half. I can’t remember how I knew this, but I recalled that you can tape ribbons back together. A few minutes later, the ribbon was back in service, but the printer was not. \n\n![This mechanism had old rubber that caused it to stick](https://nolen.io/uploads/2023/32d7e7c278.jpg)\n\nJonathan mentioned that he had to repair his printer’s carriage mechanism. There is a small piece of rubber on the underside that turns to goo. There’s an electromagnet that moves a weight that clicks back to the start position when the magnet disengages; when that weight hits the old rubber, it sticks. When that happens, the ribbon doesn’t advance (and the symptom for mine was the torn ribbon). The area isn’t particularly easy to reach, either! I tried to cheat and scrape out the old rubber from the side of the mechanism, but that didn’t correct it. Disassembly was challenging, but not impossible (though I did rip and repair a flex cable in the process). There are quite a few small gears and at least one C-clip that needs to be removed. Once everything was apart, it was simple to remove the old rubber and clean up the sticky residue that remained. That cleared up the ribbon issue, and I finally got a test page!\n\n![Success!](https://nolen.io/uploads/2023/e3402ba83a.mov)\n\n## A Detour for the Paper Feeder\nMy printer came with a cut sheet feeder, which is only mentioned in the manual I have long enough to refer the reader to a _different_ manual, which I don’t have. It seems to be a simple enough mechanism. As the platen turns, there’s a gear that turns; the feeder attaches to this gear. This turns a mechanism on the feeder which, every so often, turns a set of rubbered wheels to push the next piece of paper down. The only trouble was that it didn’t work!\n\nFriction is created by a spring-loaded paper tray that pushes the paper towards the wheels. In my case, however, the wheels just spin on the paper. Jonathan pointed me in the direction of [J.J. Short](https://www.jjshort.com), who was able to create and apply new rubber for the wheels. The new rubber grips the paper well, but it still doesn’t reliably feed the paper.\n\nSadly, this part of the story doesn’t (yet) a happy ending. I’m not certain why the paper doesn’t feed reliably. My current guess is that the feeder’s mechanism is positioned incorrectly, so the printer is expecting the paper to be in a certain position when it isn’t. I’ve decided to put this aside for a while, and I’ll pick it up again later.\n\n![The paper feeder mechanism](https://nolen.io/uploads/2023/99dbda5f10.jpg)\n\n## Epilogue\nThis printer has been quite a project, and it still isn’t done. I’m excited to try a few new things with it, and I’ll post more on these separately!\n\n",
				"date_published": "2023-02-28T23:28:38-06:00",
				"url": "https://nolen.io/2023/02/25/repairing-a-daisywriter.html",
				"tags": ["retro"]
			},
			{
				"id": "http://nolen.micro.blog/2023/02/27/amazing-weather-in.html",
				
				"content_html": "<p>Amazing weather in San Diego today for the first <a href=\"https://www.ndss-symposium.org/ndss-program/wosoc-2023/\">Workshop on SOC Operation and Construction</a>!</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Amazing weather in San Diego today for the first [Workshop on SOC Operation and Construction](https://www.ndss-symposium.org/ndss-program/wosoc-2023/)!\n\n<img src=\"uploads/2023/3475c317c1.jpg\" width=\"600\" height=\"600\" alt=\"\"><img src=\"uploads/2023/e142b156e6.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-02-27T11:14:32-06:00",
				"url": "https://nolen.io/2023/02/27/amazing-weather-in.html"
			},
			{
				"id": "http://nolen.micro.blog/2023/02/19/this-is-a.html",
				
				"content_html": "<p>This is a great introduction to the methods behind ChatGPT and some of its ML underpinnings. <a href=\"https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/\">What is ChatGPT Doing and Why Does It Work?</a> 📚</p>\n",
				"content_text": "This is a great introduction to the methods behind ChatGPT and some of its ML underpinnings. [What is ChatGPT Doing and Why Does It Work?](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/) 📚\n",
				"date_published": "2023-02-19T12:21:06-06:00",
				"url": "https://nolen.io/2023/02/19/this-is-a.html",
				"tags": ["reading"]
			},
			{
				"id": "http://nolen.micro.blog/2022/10/14/looks-like-the.html",
				
				"content_html": "<p>Looks like the House of the Dead monitor is working again. Just in time for Halloween! Can’t wait to get this installed in the cabinet this weekend.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Looks like the House of the Dead monitor is working again. Just in time for Halloween! Can’t wait to get this installed in the cabinet this weekend.\n\n<img src=\"uploads/2022/e08ef95adc.png\" width=\"396\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-10-14T22:40:13-06:00",
				"url": "https://nolen.io/2022/10/14/looks-like-the.html"
			},
			{
				"id": "http://nolen.micro.blog/2022/10/04/last-weekend-we.html",
				
				"content_html": "<p>Last weekend, we drove down the scenic Peak-to-Peak Highway to take in the fall scenery. We even saw a moose!</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Last weekend, we drove down the scenic Peak-to-Peak Highway to take in the fall scenery. We even saw a moose!\n\n<img src=\"uploads/2022/4c9d6cbc6a.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2022/6a75ebf805.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2022/f7ece87b30.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2022/a90d4a176f.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2022/8cdbc8ea3f.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2022/8b405f1ff1.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2022/036ed68c9a.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-10-04T19:59:41-06:00",
				"url": "https://nolen.io/2022/10/04/last-weekend-we.html"
			},
			{
				"id": "http://nolen.micro.blog/2022/05/06/172437.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://cdn.uploads.micro.blog/58761/2022/b0726d7030.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-05-06T17:24:37-06:00",
				"url": "https://nolen.io/2022/05/06/172437.html"
			},
			{
				"id": "http://nolen.micro.blog/2022/04/27/taken-today-at.html",
				
				"content_html": "<p>Taken today at the <a href=\"https://bouldercolorado.gov/trailhead/lost-gulch-overlook\">Lost Gulch Overlook</a> near Boulder.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Taken today at the [Lost Gulch Overlook](https://bouldercolorado.gov/trailhead/lost-gulch-overlook) near Boulder.\n\n<img src=\"https://cdn.uploads.micro.blog/58761/2022/d6ca5eaa57.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-04-27T19:16:28-06:00",
				"url": "https://nolen.io/2022/04/27/taken-today-at.html"
			},
			{
				"id": "http://nolen.micro.blog/2022/04/26/moving-my-site.html",
				
				"content_html": "<p>Moving my site from Squarespace to Micro.blog. After reading through <a href=\"https://book.micro.blog\">Indie Microblogging</a>, I decided that supporting indie software development and owning my content was the best of both worlds.</p>\n",
				"content_text": "Moving my site from Squarespace to Micro.blog. After reading through [Indie Microblogging](https://book.micro.blog), I decided that supporting indie software development and owning my content was the best of both worlds.\n",
				"date_published": "2022-04-26T12:28:12-06:00",
				"url": "https://nolen.io/2022/04/26/moving-my-site.html"
			}
	]
}
